# RadialDimensionTypeId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BendingDetailCustomFieldProperties..::..RadialDimensionTypeId Property
BendingDetailCustomFieldProperties Class See Also
---
Identifies the Id of the radial dimension type which is used to show dimensions.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ElementId RadialDimensionTypeId { get; set; }
```

Visual Basic
---
```text
Public Property RadialDimensionTypeId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ RadialDimensionTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The radialDimensionTypeId should be an id of a radial dimension type. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace